Autodesk.Revit.DB.ElementFilter.PassesFilter(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Applies the filter to a given element.
document:
The document.
id:
The element id.
Returns:
True if the element is accepted by the filter.  False if the element is rejected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementFilter.PassesFilter(Autodesk.Revit.DB.Element)
Applies the filter to a given element.
element:
The element.
Returns:
True if the element is accepted by the filter.  False if the element is rejected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementFilter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ElementFilter.Inverted
True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
and elements that would normally be rejected will be accepted.
Since:
2011

Autodesk.Revit.DB.ElementFilter
A base class for a type of filter that accepts or rejects elements based upon criteria.
Since:
2011